nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/glcd/processor/glcd_p32mz1064dah169.h
PLIB_INLINE_API bool PLIB_GLCD_ExistsIsLastRow(GLCD_MODULE_ID index)
{
     return GLCD_ExistsIsLastRow_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_IsLastRow(GLCD_MODULE_ID index)
{
     return GLCD_IsLastRow_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsGlobalColorLUT(GLCD_MODULE_ID index)
{
     return GLCD_ExistsGlobalColorLUT_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_GlobalColorLUTSet(GLCD_MODULE_ID index, uint32_t* globalLUT)
{
     GLCD_GlobalColorLUTSet_Default(index, globalLUT);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_GlobalColorLUTGet(GLCD_MODULE_ID index, uint32_t lutIndex)
{
     return GLCD_GlobalColorLUTGet_Default(index, lutIndex);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsCursorData(GLCD_MODULE_ID index)
{
     return GLCD_ExistsCursorData_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_CursorDataSet(GLCD_MODULE_ID index, uint32_t* cursorData)
{
     GLCD_CursorDataSet_Default(index, cursorData);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_CursorDataGet(GLCD_MODULE_ID index, uint32_t dataIndex)
{
     return GLCD_CursorDataGet_Default(index, dataIndex);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsCursorLUT(GLCD_MODULE_ID index)
{
     return GLCD_ExistsCursorLUT_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_CursorLUTSet(GLCD_MODULE_ID index, uint32_t* cursorLUT)
{
     GLCD_CursorLUTSet_Default(index, cursorLUT);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_CursorLUTGet(GLCD_MODULE_ID index, uint32_t lutIndex)
{
     return GLCD_CursorLUTGet_Default(index, lutIndex);
}

#endif
